In [1]:
import pandas as pd

In [2]:
#clean data

In [3]:
data = pd.read_csv('files/titanic_imp.csv')

In [4]:
pd.options.display.max_rows= 10

In [5]:
data.head()

  Survived  Class  Gender   Age  SipSp  ParCh      Fare Emb Deck
0        0      3    male  22.0      1      0     $7.25   S  NaN
1        1      1  female  38.0      1      0  $71.2833   C    C
2        1      3  female  26.0      0      0    $7.925   S  NaN
3        1      1  female  35.0      1      0     $53.1   S    C
4        0      3    male  35.0      0      0     $8.05   S  NaN

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 894 entries, 0 to 893
Data columns (total 9 columns):
Survived    894 non-null object
Class       894 non-null int64
Gender      894 non-null object
Age         758 non-null object
SipSp       894 non-null int64
ParCh       894 non-null int64
Fare        894 non-null object
Emb         892 non-null object
Deck        203 non-null object
dtypes: int64(3), object(6)
memory usage: 62.9+ KB

In [7]:
#data['Survive','age','fare'] column should be an int64 and age float , fare float

In [8]:
data.describe()

            Class       SipSp       ParCh
count  894.000000  894.000000  894.000000
mean     2.309843    0.522371    0.381432
std      0.835370    1.101283    0.805171
min      1.000000    0.000000    0.000000
25%      2.000000    0.000000    0.000000
50%      3.000000    0.000000    0.000000
75%      3.000000    1.000000    0.000000
max      3.000000    8.000000    6.000000

In [9]:
#selecting non-numeric

In [10]:
data[['Survived','Gender','Age','Fare','Emb','Deck']].describe()

       Survived Gender           Age   Fare  Emb Deck
count       894    894           758    894  892  203
unique        4      2            92    248    3    7
top           0   male  Missing Data  $8.05    S    C
freq        551    580            41     43  647   59

In [11]:
data['Survived'].unique()

array(['0', '1', 'yes', 'no'], dtype=object)

In [12]:
data['Survived'].value_counts()

0      551
1      341
no       1
yes      1
Name: Survived, dtype: int64

In [13]:
#data['Survived'] should only (0,1) or (yes,no)

In [14]:
data['Survived'].replace(to_replace=['yes','no'],value=[1,0],inplace=True)

In [15]:
data['Survived'].value_counts()

0    551
1    341
1      1
0      1
Name: Survived, dtype: int64

In [16]:
#first (0,1) still refers as object dtype and last(1,0) as int64 dtype

In [17]:
new_data = pd.read_csv('files/summer_imp.csv')

In [18]:
new_data.head()

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold Medal
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"Malokinis, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold Medal
4,1896,Athens,Aquatics,Swimming,"Chasapis, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [19]:
new_data.tail()

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
31165,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31166,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31167,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31168,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31169,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [20]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31170 entries, 0 to 31169
Data columns (total 9 columns):
Year            31170 non-null int64
City            31170 non-null object
Sport           31170 non-null object
Discipline      31170 non-null object
Athlete Name    31170 non-null object
Country         31166 non-null object
Gender          31170 non-null object
Event           31170 non-null object
Medal           31170 non-null object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [21]:
#Athlete Name column is not a robust name

In [22]:
#rename

In [23]:
new_data.rename(columns= {'Athlete Name':'Athlete_name'},inplace=True)

In [24]:
new_data.head()

,Year,City,Sport,Discipline,Athlete_name,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold Medal
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"Malokinis, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold Medal
4,1896,Athens,Aquatics,Swimming,"Chasapis, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [26]:
new_data['Medal'].head(20)

0     Gold Medal
1         Silver
2         Bronze
3     Gold Medal
4         Silver
         ...
15          Gold
16        Silver
17        Bronze
18          Gold
19        Silver
Name: Medal, Length: 20, dtype: object

In [27]:
#for first rows some values are ['Gold Medal'] but later its just ['Gold']

In [28]:
new_data['Medal'].unique()

array(['Gold Medal', 'Silver', 'Bronze', 'Gold'], dtype=object)

In [30]:
#['Gold Medal'] should be ['Gold'] #inconsistency

In [32]:
new_data['Medal'].value_counts()

Gold          10483
Bronze        10372
Silver        10311
Gold Medal        4
Name: Medal, dtype: int64

In [33]:
new_data['Medal'].replace(to_replace ='Gold Medal',value='Gold',inplace=True)

In [34]:
new_data['Medal'].value_counts()

Gold      10487
Bronze    10372
Silver    10311
Name: Medal, dtype: int64

In [36]:
new_data.iloc[:,1:].describe() #non numeric describe

,City,Sport,Discipline,Athlete_name,Country,Gender,Event,Medal
count,31170,31170,31170,31170,31166,31170,31170,31170
unique,22,43,67,22763,147,2,666,3
top,London,Aquatics,Athletics,"PHELPS, Michael",USA,Men,Football,Gold
freq,3567,4170,3639,22,4586,22751,1497,10487

In [37]:
#string validation

In [38]:
data['Fare']

0         $7.25
1      $71.2833
2        $7.925
3         $53.1
4         $8.05
         ...
889       $30.0
890       $7.75
891       $10.5
892       $14.4
893     $7.8958
Name: Fare, Length: 894, dtype: object

In [40]:
#it has dtype object should be float type

In [41]:
# the [$] sign is the main reason for it

In [44]:
data['Fare']=data['Fare'].str.replace('$','')

In [45]:
data['Fare'].head()

0       7.25
1    71.2833
2      7.925
3       53.1
4       8.05
Name: Fare, dtype: object

In [46]:
#dtype is still object to make it numeric

In [47]:
pd.to_numeric(data['Fare'])

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
889    30.0000
890     7.7500
891    10.5000
892    14.4000
893     7.8958
Name: Fare, Length: 894, dtype: float64

In [48]:
###

In [49]:
new_data.head()

,Year,City,Sport,Discipline,Athlete_name,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"Malokinis, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"Chasapis, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [51]:
pd.options.display.max_rows= 20
new_data['Athlete_name']

0                        HAJOS, Alfred
1                     HERSCHMANN, Otto
2                    DRIVAS, Dimitrios
3                   Malokinis, Ioannis
4                   Chasapis, Spiridon
5                Chorophas, Efstathios
6                        Hajos, Alfred
7                     Andreou, Joannis
8                Chorophas, Efstathios
9                        Neumann, Paul
                      ...
31160                    AHMADOV, Emin
31161             KAZAKEVIC, Aleksandr
31162                    KHUGAEV, Alan
31163     EBRAHIM, Karam Mohamed Gaber
31164                  GAJIYEV, Danyal
31165               JANIKOWSKI, Damian
31166        REZAEI, Ghasem Gholamreza
31167                   TOTROV, Rustam
31168                ALEKSANYAN, Artur
31169                   LIDBERG, Jimmy
Name: Athlete_name, Length: 31170, dtype: object

In [52]:
#string consistency failed as some of the name has all capital letter and some of them are not

In [53]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31170 entries, 0 to 31169
Data columns (total 9 columns):
Year            31170 non-null int64
City            31170 non-null object
Sport           31170 non-null object
Discipline      31170 non-null object
Athlete_name    31170 non-null object
Country         31166 non-null object
Gender          31170 non-null object
Event           31170 non-null object
Medal           31170 non-null object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [55]:
new_data['Athlete_name'] = new_data['Athlete_name'].str.title() #str.upper()  str.lower()

In [57]:
new_data['Athlete_name']

0                        Hajos, Alfred
1                     Herschmann, Otto
2                    Drivas, Dimitrios
3                   Malokinis, Ioannis
4                   Chasapis, Spiridon
5                Chorophas, Efstathios
6                        Hajos, Alfred
7                     Andreou, Joannis
8                Chorophas, Efstathios
9                        Neumann, Paul
                      ...
31160                    Ahmadov, Emin
31161             Kazakevic, Aleksandr
31162                    Khugaev, Alan
31163     Ebrahim, Karam Mohamed Gaber
31164                  Gajiyev, Danyal
31165               Janikowski, Damian
31166        Rezaei, Ghasem Gholamreza
31167                   Totrov, Rustam
31168                Aleksanyan, Artur
31169                   Lidberg, Jimmy
Name: Athlete_name, Length: 31170, dtype: object

In [58]:
#filter column of "Hajos, Alfred"

In [60]:
new_data.loc[new_data['Athlete_name']== 'Hajos, Alfred']

Empty DataFrame
Columns: [Year, City, Sport, Discipline, Athlete_name, Country, Gender, Event, Medal]
Index: []

In [61]:
#most possible reason is there is some whitespace

In [62]:
new_data.iloc[0,4]

' Hajos, Alfred '

In [63]:
#there is some space before and after ' Hajos, Alfred '

In [65]:
#str.contain method can be useful

In [66]:
new_data.loc[new_data['Athlete_name'].str.contains('Hajos, Alfred')]

,Year,City,Sport,Discipline,Athlete_name,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"Hajos, Alfred",HUN,Men,100M Freestyle,Gold
6,1896,Athens,Aquatics,Swimming,"Hajos, Alfred",HUN,Men,1200M Freestyle,Gold

In [68]:
#but best is removing space

In [70]:
new_data['Athlete_name'] = new_data['Athlete_name'].str.strip() #lstrip()  #rstrip()

In [71]:
#now filter

In [72]:
new_data.loc[new_data['Athlete_name']== 'Hajos, Alfred']

,Year,City,Sport,Discipline,Athlete_name,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"Hajos, Alfred",HUN,Men,100M Freestyle,Gold
6,1896,Athens,Aquatics,Swimming,"Hajos, Alfred",HUN,Men,1200M Freestyle,Gold

In [73]:
new_data.loc[new_data['Athlete_name']=='Phelps, Michael']

,Year,City,Sport,Discipline,Athlete_name,Country,Gender,Event,Medal
25229,2004,Athens,Aquatics,Swimming,"Phelps, Michael",USA,Men,100M Butterfly,Gold
25257,2004,Athens,Aquatics,Swimming,"Phelps, Michael",USA,Men,200M Butterfly,Gold
25262,2004,Athens,Aquatics,Swimming,"Phelps, Michael",USA,Men,200M Freestyle,Bronze
25269,2004,Athens,Aquatics,Swimming,"Phelps, Michael",USA,Men,200M Individual Medley,Gold
25281,2004,Athens,Aquatics,Swimming,"Phelps, Michael",USA,Men,400M Individual Medley,Gold
25290,2004,Athens,Aquatics,Swimming,"Phelps, Michael",USA,Men,4X100M Freestyle Relay,Bronze
25329,2004,Athens,Aquatics,Swimming,"Phelps, Michael",USA,Men,4X100M Medley Relay,Gold
25365,2004,Athens,Aquatics,Swimming,"Phelps, Michael",USA,Men,4X200M Freestyle Relay,Gold
27228,2008,Beijing,Aquatics,Swimming,"Phelps, Michael",USA,Men,100M Butterfly,Gold
27256,2008,Beijing,Aquatics,Swimming,"Phelps, Michael",USA,Men,200M Butterfly,Gold
...,...,...,...,...,...,...,...,...,...
27280,2008,Beijing,Aquatics,Swimming,"Phelps, Michael",USA,Men,400M Individual Medley,Gold
27295,2008,Beijing,Aquatics,Swimming,"Phelps, Michael",USA,Men,4X100M Freestyle Relay,Gold
27331,2008,Beijing,Aquatics,Swimming,"Phelps, Michael",USA,Men,4X100M Medley Relay,Gold
27370,2008,Beijing,Aquatics,Swimming,"Phelps, Michael",USA,Men,4X200M Freestyle Relay,Gold
29275,2012,London,Aquatics,Swimming,"Phelps, Michael",USA,Men,100M Butterfly,Gold
29303,2012,London,Aquatics,Swimming,"Phelps, Michael",USA,Men,200M Butterfly,Silver
29314,2012,London,Aquatics,Swimming,"Phelps, Michael",USA,Men,200M Medley,Gold
29345,2012,London,Aquatics,Swimming,"Phelps, Michael",USA,Men,4X100M Freestyle,Silver
29375,2012,London,Aquatics,Swimming,"Phelps, Michael",USA,Men,4X100M Medley,Gold
29410,2012,London,Aquatics,Swimming,"Phelps, Michael",USA,Men,4X200M Freestyle,Gold